{
  "bot": [
    { "messages": [{ "option": ["What brings you here today?"] }] },
    {
      "messages": [
        {
          "option": [
            "I can't log in",
            "I have problems with Java",
            "The system is down"
          ]
        }
      ]
    },

    {
      "messages": [
        {
          "option": [
            "Check internet Connection",
            "Correct email and password",
            "Reset your password"
          ]
        }
      ]
    },
    {
      "messages": [
        {
          "option": [
            "Null pointer exception",
            "Confusing the comparison operator ( == ) with the assignment operator ( = )",
            "Using comparison operator ( == ) instead of the .equals() for checking equal strings."
          ]
        }
      ]
    },
    {
      "messages": [
        {
          "option": [
            "Not accessible over the web",
            "Not accessible over the mobile",
            "Overload"
          ]
        }
      ]
    },
    {
      "messages": [
        { "option": ["Fix mobile data problems", "Fix Wi-Fi problems"] }
      ]
    },

    {
      "messages": [
        {
          "option": [
            "Check that mobile data is turned on and you have a data connection. Open your Settings app and tap Network & internet or Connections and then Mobile data or Cellular data. On some devices, you may need to select Data usage before you find this. Turn Mobile data or Cellular data on. If it's already on, turn it off and on again. Check that there is a data indicator, like 2G, 3G, 4G, or H, next to the signal strength bars at the top of the screen. Sometimes this won't display if you have an active Wi-Fi connection. If this is the case, turn Wi-Fi off and check again. If you don't get a signal data indicator, you may be in an area without coverage. If you can, move to a different area, or go outside, and check your signal again. Tip: If this happens a lot, contact your mobile service provider. Turn airplane mode on and off. Open your Settings app and tap Network & internet or Connections and then Airplane Mode. Depending on your device, these options may be different. Turn Airplane mode on. Wait for 10 seconds. Turn Airplane mode off. Check if the connection problems have been solved. If you still have problems after you complete these steps, contact your mobile service provider."
          ]
        }
      ]
    },

    {
      "messages": [
        {
          "option": [
            "Check that Wi-Fi is turned on and you're connected. Open your Settings app and tap Network & Internet or Connections and then Wi-Fi. Depending on your device, these options may be different. Turn Wi-Fi on. Find the Wi-Fi connection indicator at the top of your screen . If this isn't displayed, or none of the bars are filled in, you may be out of range of a Wi-Fi network. Move closer to the router, check if you have a stronger Wi-Fi connection, and try again. Restart your wireless router, If you are connecting to Wi-Fi at home, check your router's manual for instructions on how to reset it. Often you can: Unplug the router from the electrical outlet and make sure the lights on the router go out. Wait 30 seconds. Plug the router back in and wait 30 seconds for all the lights to come back on. If you still have connectivity issues after you complete these steps, contact your internet service provider or the host of the Wi-Fi network."
          ]
        }
      ]
    },

    {
      "messages": [
        {
          "option": [
            "If you're having trouble loading the website sometimes or at all then there might be a problem with your internet connection that's preventing you from logging in. Visit www.https//:example.com to learn more"
          ]
        },
        {
          "option": [
            "Are you using the correct email and password? , After ordering your account, we sent you an email with a link to set your password. It contains the text. If you recently opened an account with us, find this email, and use that to set your password using the link it contains. If you can't find this email, or if you've changed your password since then, you can always reset your password from the login page."
          ]
        },
        {
          "option": [
            "First, click the \"Forgot password?\" link below the login form. Then, enter the email address you registered the account with, make sure that \"Reset customer password\" is selected, and click \"Send password reset email.\" You'll be sent an email with instructions on how to reset your password and log into your account. Are you entering your password exactly as it was set? Passwords are case-sensitive, so make sure that you are capitalizing when appropriate, and that you don't have Caps Lock on. Also, note that passwords never contain spaces, so make sure you're not hitting the space bar at the start, end, or middle of entering your password."
          ]
        }
      ]
    },
    {
      "messages": [
        {
          "option": [
            "Solution: If it is possible at some point your object to become null, you should think of adding null checks to your code especially when you did not create the object yourself. Also, it is better to return empty collections instead of nulls. Adding validations to set and get methods is also a good idea."
          ]
        },
        {
          "option": [
            "Solution: You will need some time to adapt, if you are coming from another language. An easy trick I have used for remembering this is: if you know that you are interested in only one of the values (you are assigning the one to the other), you use single ' = ', otherwise if you care about both variables and values (you are comparing them) you need the double ' == '"
          ]
        },
        {
          "option": [
            "Solution: All Java objects are not being checked for equality with the comparison operator ( == ). Instead we use .equals() method. In Java the String is an immutable object instead of a primitive type."
          ]
        }
      ]
    },
    {
      "messages": [
        {
          "option": ["Restart your and reload your website"]
        },
        {
          "option": ["Restart your device"]
        },
        {
          "subOpoptiontion": [
            "Overload, very simply, is 'when demand exceeds capacity' One way to respond is with load shedding work to shed the excess load before it crushes the application. When at capacity, return errors before doing any work. Calculate the capacity of your service and determine what you can handle at the application server, and then serve an error to every request past that number."
          ]
        }
      ]
    }
  ]
}
